{
  "Examen para PPS02": [
    [
      "El nivel 2 del ASVS está dirigido a",
      [
        [
          "Software propietario",
          false
        ],
        [
          "Todo tipo de software",
          false
        ],
        [
          "Aplicaciones que manejen datos sensibles",
          true
        ],
        [
          "Entornos móviles con transacciones económicas",
          false
        ]
      ]
    ],
    [
      "OWASP ofrece un Top de riesgos para móviles y para web. ¿Verdadero o falso?",
      [
        "verdadero"
      ]
    ],
    [
      "¿Qhé ventajas ofrece el software de fuentes abiertas?",
      [
        [
          "Reducción de tiempos de acceso al dato",
          false
        ],
        [
          "Estabilidad, Seguridad, Colaboración",
          true
        ],
        [
          "Sostenibilidad",
          false
        ],
        [
          "Modelo claro de desarrollo seguro",
          false
        ]
      ]
    ],
    [
      "¿Cuál es el TOP1 de OWASP?",
      [
        [
          "Fallos Criptográficos",
          false
        ],
        [
          "Pérdida de Control de Acceso al Dato",
          true
        ],
        [
          "Diseño Inseguro",
          false
        ],
        [
          "Componentes vulnerables y obsoletos",
          false
        ]
      ]
    ],
    [
      "La idea y el movimiento detrás del software de fuentes abiertas ha sido",
      [
        [
          "Criticada por programadores expertos",
          false
        ],
        [
          "Criticada por la gran mayoría de las compañias de software",
          false
        ],
        [
          "Aceptada por algunos sectores muy especificos",
          false
        ],
        [
          "Ampliamente reconocida y aceptada tanto por empresas como por expertos programadores",
          true
        ]
      ]
    ],
    [
      "La fundación OWASP es una fundación con ánimo de lucro. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Cuando el código es accesible los usuarios pueden acceder a él, mejorándolo en muchos casos. ¿Verdadero o falso?",
      [
        "verdadero"
      ]
    ],
    [
      "El objetivo de las pruebas de aceptación es verificar la sincronización entre módulos. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "El software de fuentes abiertas no tiene relación con la seguridad. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Cuando estamos desarrollando software es recomendable",
      [
        [
          "Saber que pruebas de software vamos a realizar",
          false
        ],
        [
          "Conocer el resultado de nuestro código de manera exacta",
          false
        ],
        [
          "Conocer el número de funciones que necesitamos",
          false
        ],
        [
          "Tener un entorno de desarrollo",
          true
        ]
      ]
    ],
    [
      "El codigo fuente no es más que un conjunto de caracteres sin orden ni estructura. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Podriamos definir el objetivo de OWASP como",
      [
        [
          "Comprobar appliaciones web y móviles para mejorar la seguridad del software",
          false
        ],
        [
          "Proporcionar una guía de referencia identificando riesgos y controles para las apliaciones",
          true
        ],
        [
          "Comprobar aplicaciones web para mejorar la seguridad del softwware",
          false
        ],
        [
          "Ayudar en la comprobación del software",
          false
        ]
      ]
    ],
    [
      "¿Existe relación entre los datos manejados y el nivel ASVS?",
      [
        [
          "Sí, según el tipo de dato manejado por la aplicación",
          true
        ],
        [
          "Sí, a mayor volumen de datos mayor nivel de ASVS",
          false
        ],
        [
          "Si, es inversamente proporcional",
          false
        ],
        [
          "No",
          false
        ]
      ]
    ],
    [
      "Las aplicaciones de nivel 1 del ASVS no tienen que cumplir ningún requisito. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "En el TOP10 de OWASP está el ataque de Man-In-The-Middle. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "El TOP10 de OWASP tiene el objetivo de identificar riesgos. ¿Verdadero o falso?",
      [
        "verdadero"
      ]
    ],
    [
      "Los requisitos del ASVS se fijaron con el objetivo de tener una métrica a nivel de seguridad. ¿Verdadero o falso?",
      [
        "verdadero"
      ]
    ],
    [
      "¿Qué controles se tienen en cuenta en el ASVS?",
      [
        [
          "Importaciones del software",
          false
        ],
        [
          "Proceso compilación",
          false
        ],
        [
          "Autenticación y comunicaciones",
          true
        ],
        [
          "Flujo de programa",
          false
        ]
      ]
    ],
    [
      "¿Cuál es el objetivo de ASVS?",
      [
        [
          "Evaluar aplicaciones",
          false
        ],
        [
          "Evaluar el código para un software más seguro",
          false
        ],
        [
          "Elaborar el estándar obligatorio para las compañias de software",
          false
        ],
        [
          "Ayudar el desarrollo seguro y alinear necesidades entre todas las partes",
          true
        ]
      ]
    ],
    [
      "Los datos personales no condicionan los niveles del ASVS. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ]
  ],
  "Examen para AFI01": [
    [
      "¿Qué elementos mínimos debe de tener el documento de cadena de custodia?",
      [
        [
          "Identificación unívoca",
          true
        ],
        [
          "Registro de control",
          true
        ],
        [
          "Código fuente",
          false
        ],
        [
          "Línea de tiempo",
          true
        ]
      ]
    ],
    [
      "A nivel de herramientas físicas necesitaremos",
      [
        [
          "Baterias externas",
          false
        ],
        [
          "Palancas",
          false
        ],
        [
          "Cajas",
          false
        ],
        [
          "Cables y conectores",
          true
        ]
      ]
    ],
    [
      "No es necesario conocer o investigar cuanto tiempo ha estado el atacante dentro de la organización. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "¿Cuáles son las principales fuentes de información?",
      [
        [
          "Dispositivos móviles",
          false
        ],
        [
          "Dispositivos físicos y fuentes lógicas",
          true
        ],
        [
          "Discos duros",
          false
        ],
        [
          "Discos duros y dispositivos móviles",
          false
        ]
      ]
    ],
    [
      "La cadena de custodia de las evidencias no tiene en cuenta las personas que han analizado la evidencia pero no la han modificado. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "¿Cuál de los siguientes es un objetivo del análisis forense?",
      [
        [
          "Saber qué ha pasado",
          false
        ],
        [
          "Todas las anteriores",
          true
        ],
        [
          "Tener claro la linea de tiempo de lo que ha sucedido",
          false
        ],
        [
          "investigar quien está detrás del ataque",
          false
        ]
      ]
    ],
    [
      "Cuando investigamos un incidente a nivel forense deberemos",
      [
        [
          "Comentar los detalles del caso con amigos y familiares",
          false
        ],
        [
          "Avisar a nuestros compañeros de nuestra nueva asignación de tarea",
          false
        ],
        [
          "Tener clara la metodología y los fases necesarias",
          true
        ],
        [
          "Comprar las herramientas necesarias",
          false
        ]
      ]
    ],
    [
      "Las fuentes de información no tienen que estar relacionada con las preguntas que debemos responder . ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Despues de la fase de identificación deberemos",
      [
        [
          "Proceder a la adquisición de las evidencias debidamente documentadas",
          true
        ],
        [
          "Documentar el proceso seguido",
          false
        ],
        [
          "Avisar al coordinador del incidente",
          false
        ],
        [
          "Desplegar nuestras herramientas sobre el terreno",
          false
        ]
      ]
    ],
    [
      "¿Qué debemos de hacer cuando encontramos algo que nos llama la atención en un escenario forense?",
      [
        [
          "Comentarlo con el compañero",
          false
        ],
        [
          "Discernir en ese momento si es relevante o no",
          false
        ],
        [
          "Anotarlo",
          true
        ],
        [
          "Avisar a las autoridades",
          false
        ]
      ]
    ],
    [
      "Los analistas forenses suelen llevar sus herramientas lógicas en portátiles o discos externos. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "El objetivo de un analista forense es poder contar la historia de lo que ha sucedido. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Cuál ha sido uno de los factores del crecimiento de la necesidad de forenses informáticos?",
      [
        [
          "Aumento de aplicaciones y servicios",
          false
        ],
        [
          "Todas las anteriores",
          true
        ],
        [
          "Transformación digital",
          false
        ],
        [
          "Auge de los dispositivos móviles",
          false
        ]
      ]
    ],
    [
      "¿Que punto es necesario en nuestro informe?",
      [
        [
          "Detalle de las evidencias analizadas",
          false
        ],
        [
          "Informes de cadena de custodia",
          false
        ],
        [
          "Resumen ejecutivo",
          true
        ],
        [
          "Nuestra opinión",
          false
        ]
      ]
    ],
    [
      "En una investigación forense deberemos de reflejar en qué sistemas ha sucedido el ataque. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Una fuente de información es cualquier tipo de evidencia que pudiera aportar visibilidad. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Qué pasa si no se preserva la cadena de custodia?",
      [
        [
          "Que no podremos responer las preguntas de manera correcta",
          false
        ],
        [
          "La evidencia podría ser impugnada",
          true
        ],
        [
          "Que nos estaremos saltando varias fases y procesos",
          false
        ],
        [
          "Que sería ilegal",
          false
        ]
      ]
    ],
    [
      "Necesitaremos de herramientas especificas tanto físicas como lógicas en el análisis forense. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Dentro del análisis forense podemos encontrar dos escenarios, dependiendo si el caso será llevado ante un proceso judicial. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "No es necesario incluir todas las herramientas físicas en el maletín forense, iremos ampliando según vaya progresando la investigación. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ]
  ],
  "BRS01. Examen": [
    [
      "El bastionado de sistemas disminuye el número de incidentes y su criticidad. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "El bastionado o hardening, busca principalmente",
      [
        [
          "Reducir o mitigar las vulnerabilidades a través de políticas, medidas técnicas de seguridad, o cualquier otro mecanismo que lo consiga",
          true
        ],
        [
          "Dotar de capacidades a los usuarios para que identifiquen las amenazas",
          false
        ],
        [
          "Aumentar y mitigar las vulnerabilidades a través de políticas, medidas técnicas de seguridad, o cualquier otro mecanismo que lo consiga",
          false
        ]
      ]
    ],
    [
      "Indica cuál de los siguientes no es un malware",
      [
        [
          "Rootkit",
          false
        ],
        [
          "Phishing",
          true
        ],
        [
          "Keylogger",
          false
        ]
      ]
    ],
    [
      "Las tecnologías más populares, tienen menos vulnerabilidades. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "De cara a saber donde aplicar los esfuerzos de bastionado. ¿Qué se debe realizar previamente al bastionado?",
      [
        [
          "Análisis de riesgos",
          true
        ],
        [
          "Análisis de costes",
          false
        ],
        [
          "Pruebas de estrés",
          false
        ]
      ]
    ],
    [
      "¿En qué 3 elemento se apoya la ciberseguridad?",
      [
        [
          "Paquetes, tramas y segmentos",
          false
        ],
        [
          "Procesos, personas y tecnologías",
          true
        ],
        [
          "Instalaciones, cámaras y tornos de acceso",
          false
        ]
      ]
    ],
    [
      "La medidas organizativas no forman parte de la medidas de bationado. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La aplicación de medidas de seguridad es una medida técnica que SOLO se aplica durante el proceso de instalación del sisema. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La seguridad se ha implementado desde los orígenes de los primeros ordenadores. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "¿Para cuál de las siguientes amenazas se deben habilitar medidas de protección sobre información contra un insider?",
      [
        [
          "Rotura de un equipo",
          false
        ],
        [
          "Fuga de información",
          true
        ],
        [
          "Phishing",
          false
        ]
      ]
    ],
    [
      "Para el paradigma Zero Trust los usuarios de confianza también pasar a ser no confiables y es necesario verificar su legitimidad. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "El RGPD indica establecer acciones técnicas de seguridad sobre los sistemas que albergan datos personales. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Con qué otro nombre se conoce el bastionado de sistemas",
      [
        [
          "Hardware",
          false
        ],
        [
          "Hardening",
          true
        ],
        [
          "Hardcode",
          false
        ]
      ]
    ],
    [
      "En términos históricos y en el contexto de la ciberseguridad, ¿Cuándo podemos decir que el control y la seguridad sobre los activos comienza a ser cada vez más complejo?",
      [
        [
          "Al comienzo de los años 80",
          false
        ],
        [
          "En la década del 2000",
          true
        ],
        [
          "En los años 90",
          false
        ]
      ]
    ],
    [
      "Un centro de respuesta a incidentes de seguridad también es conocido con las siglas",
      [
        [
          "CRIST",
          false
        ],
        [
          "CSITR",
          false
        ],
        [
          "CSIRT",
          true
        ]
      ]
    ],
    [
      "Indica cuál no es una amenaza en ciberseguridad",
      [
        [
          "Phishing",
          false
        ],
        [
          "Malware",
          false
        ],
        [
          "Smurfing blue attack",
          true
        ]
      ]
    ],
    [
      "¿Cuál es el nombre de uno de los primeros virus?",
      [
        [
          "Wannacry",
          false
        ],
        [
          "Ryuk",
          false
        ],
        [
          "Creeper",
          true
        ]
      ]
    ],
    [
      "¿Cuál es uno de las riesgos asociados al Zero Trust?",
      [
        [
          "La seguridad de los sistemas obsoletos",
          false
        ],
        [
          "El volumen de datos de los sistemas",
          false
        ],
        [
          "Difusión del perímetro",
          true
        ]
      ]
    ],
    [
      "¿Por qué motivo puede ser necesario realizar acciones de bastionado en los sistemas?",
      [
        [
          "Mejora de la productividad laboral",
          false
        ],
        [
          "Mejorar el ROI (Retorno de la inversión)",
          false
        ],
        [
          "Requerimientos legales",
          true
        ]
      ]
    ],
    [
      "La ciberseguridad está condicionada por el negocio. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ]
  ],
  "BRS02. Examen": [
    [
      "Una característica del análisis de riesgos sería",
      [
        [
          "Se ha de limitar el alcance",
          true
        ],
        [
          "Tiene que considerar toda la organización incluso donde no hay TICs",
          false
        ],
        [
          "Únicamente se han de analizar los riesgos de las empresas clientes",
          false
        ],
        [
          "Están definidas en la norma ISO170002",
          false
        ]
      ]
    ],
    [
      "\"El residuo se convierte en recurso. Todo el material biodegradable vuelve a la naturaleza y el no biodegradable se reutiliza\" es un principio fundamental de la economía circular ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Qué elemento no forma parte de la caracterización de un procedimiento?",
      [
        [
          "Propietario",
          false
        ],
        [
          "Capacidad",
          true
        ],
        [
          "Cliente",
          false
        ],
        [
          "Objetivo del proceso",
          false
        ]
      ]
    ],
    [
      "Un IDS es una herramienta de tipo reactivo ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La limitación del alcance, nunca se debe considerar en una análisis de riesgos. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Las fases de un análisis de riesgos son",
      [
        [
          "Escaneo, mitigación y valoración",
          false
        ],
        [
          "Reconocimiento, mitigación y valoración",
          true
        ],
        [
          "Reconocimiento, mitigación e indicadores",
          false
        ],
        [
          "Disposición, mitigación y valoración",
          false
        ]
      ]
    ],
    [
      "Dentro de los modelos de madurez CMM ¿Cuál no estaría incluido?",
      [
        [
          "Definido",
          false
        ],
        [
          "Administrado",
          false
        ],
        [
          "Inexistente",
          false
        ],
        [
          "En ejecución",
          true
        ]
      ]
    ],
    [
      "Una copia de seguridad por sí sola, sin verificación, ya es una medida de protección con la que una organización puede considerarse medianamente protegida. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "¿El NIST Framework se puede considerar como un marco de buenas prácticas en ciberseguridad? ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "En la economía circular, las materias multimaterial son más fáciles de reciclar. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "¿Qué elemento forma parte de la caracterización de un procedimiento?",
      [
        [
          "Climatología",
          false
        ],
        [
          "Propietario",
          true
        ],
        [
          "Capacidad",
          false
        ],
        [
          "Sociedad",
          false
        ]
      ]
    ],
    [
      "Un DLP es una medida",
      [
        [
          "Medida global",
          false
        ],
        [
          "Medida técnica",
          true
        ],
        [
          "Ninguna es correcta",
          false
        ],
        [
          "Medida humana",
          false
        ]
      ]
    ],
    [
      "Las herramientas que en caso de que se materialice un incidente, puedan llevar a cabo alguna acción que permita contenerlo, eliminarlo o corregir la situación se denominan",
      [
        [
          "Sinérgicas",
          false
        ],
        [
          "Preventivas",
          false
        ],
        [
          "Preventivas y reactivas",
          false
        ],
        [
          "reactivas",
          true
        ]
      ]
    ],
    [
      "Las guías de buenas prácticas y los estándares se han diseñado con el mismo propósito ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La copia de seguridad se considera una de las claves de los planes de contingencia. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "La respuesta a incidentes y las actualizaciones son políticas de tipo",
      [
        [
          "Técnico",
          true
        ],
        [
          "Ninguna respuesta es correcta",
          false
        ],
        [
          "Organizativa",
          false
        ],
        [
          "Organizativa y técnica",
          false
        ]
      ]
    ],
    [
      "Un EDR es una medida técnica de carácter",
      [
        [
          "Preventiva y reactiva",
          true
        ],
        [
          "Exclusivamente reactiva",
          false
        ],
        [
          "Preventiva y de ejecución",
          false
        ],
        [
          "Exclusivamente preventiva",
          false
        ]
      ]
    ],
    [
      "Un activo de un sistema informático",
      [
        [
          "Es un elemento de hardware",
          false
        ],
        [
          "Es un elemento de software",
          false
        ],
        [
          "Es una amenaza para el sistema",
          false
        ],
        [
          "Puede ser una persona, un software o un hardware",
          true
        ]
      ]
    ],
    [
      "Las buenas prácticas son de obligado cumplimiento ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Un IDS es herramienta que actualmente tiene muy poca utilidad ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ]
  ],
  "BRS03. Examen": [
    [
      "Para usar tokens necesito un elemento físico como un móvil ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "En la actualidad, usar un método de acceso basado en un único factor, se puede considerar arriesgado ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Radio Frecuency IDentification se corresponde con el acrónimo",
      [
        [
          "RFIDy",
          false
        ],
        [
          "RFDI",
          false
        ],
        [
          "RFID",
          true
        ],
        [
          "RDIF",
          false
        ]
      ]
    ],
    [
      "Algunas alternativas a los sistemas de autenticación multifactor son",
      [
        [
          "Multifactor adaptativo y SSO",
          true
        ],
        [
          "Ninguno de los anteriores",
          false
        ],
        [
          "FA2 y SSO",
          false
        ],
        [
          "Multifactor adaptativo y SOS",
          false
        ]
      ]
    ],
    [
      "El acrónimo para definir el doble factor de autenticación es",
      [
        [
          "FA2",
          false
        ],
        [
          "2FA",
          true
        ],
        [
          "MFA",
          false
        ],
        [
          "A2F",
          false
        ]
      ]
    ],
    [
      "La ubicación es un elemento del MFA adaptativo ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Las siglas RFID significan",
      [
        [
          "Ninguna es correcta",
          false
        ],
        [
          "Radio Frecuency IDentation",
          false
        ],
        [
          "Radio Frecuency IDentity",
          false
        ],
        [
          "Radio Frecuency IDentification",
          true
        ]
      ]
    ],
    [
      "¿Cuál no estaría incluida como fase en el control de acceso?",
      [
        [
          "persistencia",
          true
        ],
        [
          "Autenticación",
          false
        ],
        [
          "Autorización",
          false
        ],
        [
          "Identificación",
          false
        ]
      ]
    ],
    [
      "Algunos de los elementos que pueden provocar falsos positivos a la hora de la autorización son",
      [
        [
          "OTP",
          false
        ],
        [
          "Biométricos",
          true
        ],
        [
          "Tokens",
          false
        ],
        [
          "Ninguna es correcta",
          false
        ]
      ]
    ],
    [
      "La voz y el iris son características que incardinan en la",
      [
        [
          "Biometría exclusivamente",
          true
        ],
        [
          "Biometría y contraseña",
          false
        ],
        [
          "Biometría y tokens",
          false
        ],
        [
          "Es un elemento de software",
          false
        ]
      ]
    ],
    [
      "El mecanismo lógico de identificación en los primeros tiempos se basaba en",
      [
        [
          "IP y MAC",
          false
        ],
        [
          "IP y contraseña",
          false
        ],
        [
          "Usuario e IP",
          false
        ],
        [
          "Usuario y contraseña",
          true
        ]
      ]
    ],
    [
      "El MFA adaptativo tiene en consideración cuestiones como",
      [
        [
          "La hora de acostarse",
          false
        ],
        [
          "El tipo de móvil con el que accedemos y aplicaciones instaladas",
          false
        ],
        [
          "Ninguna respuesta es correcta",
          false
        ],
        [
          "La ubicación",
          true
        ]
      ]
    ],
    [
      "Existen soluciones sin coste para la implementación de OTP ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "El mecanismo lógico de identificación en los primeros tiempos se basaba en usuario y contraseña. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Es posible acceder a información de usuarios y contraseñas mediante la descarga de bases de datos de brechas de seguridad ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "La dupla IP y contraseña se usó en los primeros tiempos para autorizarse en los sistemas. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Cuáles son los tipos de autenticación multifactor más populares",
      [
        [
          "MFA y 2FA",
          true
        ],
        [
          "Ninguno de los anteriores",
          false
        ],
        [
          "2AF y MMA",
          false
        ],
        [
          "FMA y 2AF",
          false
        ]
      ]
    ],
    [
      "Los tres tipos de factores son",
      [
        [
          "Algo que se, algo que soy y algo que tengo",
          true
        ],
        [
          "Algo que se, algo que soy y algo que tenía",
          false
        ],
        [
          "Algo que se, algo que soy y algo que vendo",
          false
        ],
        [
          "Algo que conocía, algo que soy y algo que tengo",
          false
        ]
      ]
    ],
    [
      "Los sistemas biométricos de autenticación son fiables al 100% por el avance tecnológico. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Los RFID, por sus características, nunca son usados como mecanismos de identificación. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ]
  ],
  "BRS04. Examen": [
    [
      "La segmentación por roles y la modificación periódica de una contraseña forman parte de",
      [
        [
          "De los marcos de confianza",
          false
        ],
        [
          "De los estándares de seguridad",
          false
        ],
        [
          "Una correcta gestión de credenciales",
          true
        ],
        [
          "Las dimensiones de la seguridad",
          false
        ]
      ]
    ],
    [
      "RADIUS y TACACS son protocolos orientados a la autenticación, autorización y conteo ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Los certificados de la tecnología PKI son independientes y no necesitan de intermediarios para su validación ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Los grupos por defecto en los servidores y con carácter general son",
      [
        [
          "De distribución y de seguridad",
          true
        ],
        [
          "De administración y de autenticación",
          false
        ],
        [
          "Ninguno de los anteriores",
          false
        ],
        [
          "De seguridad y de administración",
          false
        ]
      ]
    ],
    [
      "Uno de los usos más extendidos de la tecnología PKI es la firma digital ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Las contraseñas harcodeadas no son un problema en la gestión de acceso ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La firma electrónica se puede llevar a cabo a través de",
      [
        [
          "Clave pública certificada con certificado autofirmado",
          false
        ],
        [
          "Contraseña exclusivamente",
          false
        ],
        [
          "Contraseñas y datos biométricos",
          true
        ],
        [
          "Contraseñas y firma manuscrita en papel",
          false
        ]
      ]
    ],
    [
      "Para cubrir las carencias en seguridad de RADIUS se creo TACACS ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Uno de los principales problemas de un servidor RADIUS es usa el protocolo **** en su implementación",
      [
        [
          "ICMP",
          false
        ],
        [
          "UDP",
          true
        ],
        [
          "SMTP",
          false
        ],
        [
          "Ninguna respuesta es correcta",
          false
        ]
      ]
    ],
    [
      "La implementación NAC es útil para entornos",
      [
        [
          "BYOD, el acceso de terceros y para IoT",
          true
        ],
        [
          "Solo para el acceso de terceros",
          false
        ],
        [
          "Para IoT exclusivamente",
          false
        ],
        [
          "Ninguno de los anteriores",
          false
        ]
      ]
    ],
    [
      "Para cubrir las necesidades de protocolos de tipo AAA, Cisco creo",
      [
        [
          "DIAMETER",
          false
        ],
        [
          "FreeRadius",
          false
        ],
        [
          "TACACS",
          true
        ],
        [
          "Ninguna respuesta es correcta",
          false
        ]
      ]
    ],
    [
      "Un certificado web que se ha expedido, ya no es posible revocarlo, habría que adquirir uno nuevo ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "El robo de contraseñas es un resultado de una gestión ineficaz de credenciales ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "DIAMETER no es compatible con RADIUS ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Los problemas más comunes en el uso de credenciales son",
      [
        [
          "Las contraseñas seguras exclusivamente",
          false
        ],
        [
          "Ninguna es correcta",
          false
        ],
        [
          "contraseñas por defecto y compartir contraseñas",
          true
        ],
        [
          "Contraseñas por defecto y las contraseñas seguras",
          false
        ]
      ]
    ],
    [
      "Una de las características de los gestores de credenciales es que pueden ser",
      [
        [
          "Exclusivamente comerciales",
          false
        ],
        [
          "Ninguna respuesta es correcta",
          false
        ],
        [
          "No son opensource",
          false
        ],
        [
          "Multidispositivo",
          true
        ]
      ]
    ],
    [
      "En un servidor RADIUS todas las peticiones viajan cifradas ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La técnica \"Pass the hash\" es utilizada para la obtención de cuentas privilegiadas ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "La firma electrónica es un concepto electrónico que no tiene validez legal ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Algunas de las soluciones NAC opensource son",
      [
        [
          "FreeNAC y WordFence",
          false
        ],
        [
          "FreeNAC y PacketFence",
          true
        ],
        [
          "FreeNAC y FenceFirewall",
          false
        ],
        [
          "Ninguna respuesta es correcta",
          false
        ]
      ]
    ]
  ],
  "Examen para HE01": [
    [
      "¿Qué es el estándar CVSS?",
      [
        [
          "Un framework de trabajo que nos indica el tipo de vulnerabilidades a comprobar en una auditoría",
          false
        ],
        [
          "Un estándar para medir la superficie de ataque",
          false
        ],
        [
          "Un estándar de calidad",
          false
        ],
        [
          "Un estándar para la medir la criticidad de una vulnerabilidad",
          true
        ]
      ]
    ],
    [
      "¿Cuál de las siguientes labores de la fase de Pre-engagement NO es una labor organizativa?",
      [
        [
          "Identificar el entorno y enfoque de las pruebas",
          false
        ],
        [
          "Delimitar el alcance de la auditoría",
          false
        ],
        [
          "Establecer un canal de comunicación para las incidencias graves",
          true
        ],
        [
          "Designar personas de contacto durante el tiempo de auditoría",
          false
        ]
      ]
    ],
    [
      "Indica cuál de las siguientes herramientas no es un proxy de interceptación",
      [
        [
          "Shellter",
          true
        ],
        [
          "ZAP",
          false
        ],
        [
          "Echo Mirage",
          false
        ],
        [
          "Burp",
          false
        ]
      ]
    ],
    [
      "En que portal podemos buscar exploits específicos para una versión de software en concreto",
      [
        [
          "Shodan",
          false
        ],
        [
          "Censys",
          false
        ],
        [
          "Exploit-db",
          true
        ],
        [
          "LinkedIn",
          false
        ]
      ]
    ],
    [
      "¿Que es la DarkWeb?",
      [
        [
          "Redes privadas utilizadas por los ciberdelincuentes para ofrecer sus servicios, vender información previamente robada, vulnerabilidades no reportadas a los fabricantes",
          true
        ],
        [
          "Contenido utilizado por los ciberdelincuentes pero que se encuentra disponible de manera pública en internet",
          false
        ],
        [
          "Todo el contenido privado que no se encuentra a disposición del público en general",
          false
        ],
        [
          "Contenido que se encuentra disponible de manera pública en internet",
          false
        ]
      ]
    ],
    [
      "¿Cuál de las siguientes técnicas no forma parte de la fase de reconocimiento activo?",
      [
        [
          "Enumeración SMB (o enumeración NetBIOS)",
          false
        ],
        [
          "Enumeración SMTP",
          false
        ],
        [
          "Enumeración SNMP",
          false
        ],
        [
          "Búsqueda de información en redes sociales",
          true
        ]
      ]
    ],
    [
      "Indica cual es la afirmación correcta",
      [
        [
          "Los roles dedicados a la gestión se apoyan en el informe ejecutivo para interpretar los riesgos de la vulnerabilidad",
          true
        ],
        [
          "El informe técnico detalla los pasos de como explotar una vulnerabilidad, pero no su resolución",
          false
        ],
        [
          "Los roles dedicados a la gestión se apoyan en el informe técnico de auditoría para tomar decisiones",
          false
        ],
        [
          "El mecanismo utilizado para medir la criticidad de las vulnerabilidades se realiza según el criterio del auditor",
          false
        ]
      ]
    ],
    [
      "Cual es la afirmación más correcta para definir un ciberdelincuente/cibercriminal",
      [
        [
          "Persona con altas capacidades técnicas en seguridad con fines sociales, ecológicos, humanitarios o que tenga repercusión en la defensa de los derechos humanos",
          false
        ],
        [
          "Experto de las tecnologías de comunicación e información que utiliza sus conocimientos técnicos para encontrar y resolver un problema concreto relacionado con la seguridad de la información",
          false
        ],
        [
          "Persona con altas capacidades técnicas en seguridad con fines lucrativos utilizando los fallos de seguridad localizados",
          true
        ],
        [
          "Persona con altas capacidades técnicas",
          false
        ]
      ]
    ],
    [
      "Los sistemas de tipo Keylogger extraen información almacenada en la memoria RAM de un sistema operativo Microsoft Windows. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Indica cuál de las siguientes afirmaciones es correcta",
      [
        [
          "Las auditorías de tipo automático no generan muchos falsos positivos",
          false
        ],
        [
          "Una auditoría que haga uso de pruebas automáticas va a localizar las mismas vulnerabilidades que se localizarían en una auditoría con pruebas manuales",
          false
        ],
        [
          "El objetivo de los test de intrusión es llegar a comprometer un sistema a través de una vulnerabilidad",
          true
        ],
        [
          "En los test de intrusión únicamente se confirman vulnerabilidades",
          false
        ]
      ]
    ],
    [
      "¿Qué tipo de información podemos recopilar en las redes sociales?",
      [
        [
          "Activos pertenecientes a las empresas",
          false
        ],
        [
          "Direccionamiento IP y servicios expuestos en el perímetro de la empresa",
          false
        ],
        [
          "Averiguar tecnologías utilizadas en la compañía",
          true
        ],
        [
          "Averiguar credenciales de usuarios",
          false
        ]
      ]
    ],
    [
      "Indica cual de las siguientes afirmaciones NO es correcta para una auditoría de tipo \"Test de intrusión\"",
      [
        [
          "Las pruebas se realizan por un auditor de manera manual apoyándose en herramientas específicas. También se contempla el uso de sistemas secundarios para ciertos tipos de pruebas",
          false
        ],
        [
          "Tienen como objetivo comprobar el grado real de amenaza que podría producirse al aprovecharse de las vulnerabilidades localizadas durante la auditoría y verificar el impacto específico que tendrían sobre la compañía",
          false
        ],
        [
          "Debido a la forma en la que se detectan las vulnerabilidades, se producen muchos falsos positivos",
          true
        ],
        [
          "Tratan de comprometer el sistema remoto a través de una vulnerabilidad identificada",
          false
        ]
      ]
    ],
    [
      "Durante la presentación de resultados únicamente se presentan los resultados de la auditiría, pero no se resuelven dudas ni se dan recomendaciones para solventar las vulnerabilidades. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "¿Cuál es la fase de pruebas que se encarga de recopilar información a cerca de los activos a auditar?",
      [
        [
          "Reconocimiento",
          true
        ],
        [
          "",
          false
        ],
        [
          "Escaneo",
          false
        ]
      ]
    ],
    [
      "Indica cuál de las siguientes herramientas es utilizada para automatizar la búsqueda de vectores de elevación de privilegios en sistemas Linux",
      [
        [
          "PrivescCheck",
          false
        ],
        [
          "LinescCheck",
          false
        ],
        [
          "WinPeas",
          false
        ],
        [
          "LinPEAS",
          true
        ]
      ]
    ],
    [
      "¿Cuáles son las características del principio de integridad?",
      [
        [
          "Requiere que la información sea accesible únicamente a las personas que se encuentran autorizadas",
          false
        ],
        [
          "Requiere que la información se mantenga inalterada ante incidentes o accesos malintencionados",
          true
        ],
        [
          "Requiere que el sistema informático se mantenga accesible sin sufrir ninguna degradación o interrupción en el servicio",
          false
        ],
        [
          "Requiere que no haya malas intenciones en el acceso a los activos",
          false
        ]
      ]
    ],
    [
      "Indica cual de las siguientes opciones NO pertenece a la Fase de \"Seguimiento de las pruebas\"",
      [
        [
          "Se decidirá en qué activos o secciones incrementar el esfuerzo en las próximas semanas",
          false
        ],
        [
          "Se comunicarán los problemas que pudieran haber surgido desde la reunión anterior",
          false
        ],
        [
          "Se comunicarán al cliente los hallazgos localizados desde la reunión anterior",
          false
        ],
        [
          "Se comunicarán todas las vulnerabilidades detectadas y se procederá al cierre de la auditoría",
          true
        ]
      ]
    ],
    [
      "La herramienta msfvenom se utiliza para generar payloads y shellcodes. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Indica cual de las siguientes opciones es una afirmación correcta para la Fase de Explotación",
      [
        [
          "Se utilizan técnicas para poder aumentar el nivel de privilegios en este sistema",
          false
        ],
        [
          "Se detectan vulnerabilidades que puedan existir en los sistemas y servicios",
          false
        ],
        [
          "El objetivo es lograr un primer acceso o de privilegios en los activos",
          true
        ],
        [
          "Se recopila información acerca de los activos a auditar",
          false
        ]
      ]
    ],
    [
      "En las pruebas de caja negra nunca se proporcionan usuarios de acceso al activo a auditar. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ]
  ],
  "Examen para HE02": [
    [
      "Las antenas Omnidireccionales suelen tener menor alcance de señal que las antenas direccionales ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Cuáles de las siguientes características de una red inalámbrica se pueden averiguar monitorizando las redes Wi-FI? (Respuesta múltiple)",
      [
        [
          "Canales en los que opera el Punto de Acceso",
          true
        ],
        [
          "Nombres de las redes Wi-Fi",
          true
        ],
        [
          "Tipo de red Wi-Fi",
          true
        ],
        [
          "Dirección MAC de los Puntos de Acceso",
          true
        ]
      ]
    ],
    [
      "La banda inalámbrica de 2,4GHz soporta mayor velocidad de conexión que la banda de 5GHz ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La banda inalámbrica de los 5GHz (Respuesta múltiple)",
      [
        [
          "Sufre menos interferencias que la banda de 2,4GHZ",
          true
        ],
        [
          "Dispone de más canales de frecuencia que la banda de los 2,4GHz",
          true
        ],
        [
          "Tiene mayor velocidad de conexión que la banda de 2,4GHZ",
          true
        ],
        [
          "Tiene mayor rango de cobertura que la banda de los 2,4GHz",
          false
        ]
      ]
    ],
    [
      "¿Qué es un paquete de tipo Probe Request?",
      [
        [
          "Un paquete, enviado por un Punto de Acceso, que tiene información de las caracteríasticas de la red inalámbrica",
          false
        ],
        [
          "Un paquete, enviado por un dispositivo cliente, para averiguar si existe en su alcance alguna otra red inalámbrica de la cuál conoce la clave de acceso",
          true
        ],
        [
          "Un paquete, enviado por un dispositivo cliente, que tiene información de las caracteríasticas de la red inalámbrica",
          false
        ],
        [
          "Un paquete, enviado por un Punto de Acceso, para averiguar si existe en su alcance alguna otra red inalámbrica que pueda causar interferencias en la banda en la que opera",
          false
        ]
      ]
    ],
    [
      "La CA que genera los certificados del Punto de Acceso legítimo se puede desplegar en el cliente mediante el uso de GPO (Group Policy Object) en sistemas Microsoft. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Indica cuáles de las siguientes afirmaciones son correctas en el caso de las redes de tipo WEP (Respuesta múltiple)",
      [
        [
          "La longitud de la clave de accso es de entre 5 y 13 caracteres",
          true
        ],
        [
          "La longitud mínima de la clave de acceso es de 8 caracteres",
          false
        ],
        [
          "Las redes de tipo WEP NO son vulnerables ante ataques estadísticos para averiguar la clave de acceso",
          false
        ],
        [
          "Las redes de tipo WEP son vulnerables ante ataques estadísticos para averiguar la clave de acceso",
          true
        ]
      ]
    ],
    [
      "Las redes de tipo WEP se encuentran en desuso. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Un Beacon Frame es un paquete de información que envía el Punto de Acceso Wi-FI con información de las características de la red que publica ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Cuál de las siguientes herramientas se utiliza para suplantar un portal cautivo?",
      [
        [
          "hostapd-wpe",
          false
        ],
        [
          "Wifiphisher",
          true
        ],
        [
          "aireplay-ng",
          false
        ],
        [
          "airodump-ng",
          false
        ]
      ]
    ],
    [
      "Para ampliar el radio de cobertura de un Punto de Acceso falso se pueden utilizar altenas omnidireccionales externas de mayor potencia",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Indica cuál de las siguientes afirmaciones es correcta con respecto al ataque en redes tipo WPA/WPA2-Enterprise",
      [
        [
          "El ataque consiste en monitorizar un Punto de Acceso legítimo de la red y esperar los intentos de autenticación de los usuarios legítimos. Estos intentos de autenticación se pueden utilizar para obtener las credenciales de los usuarios mediante un proceso de cracking",
          false
        ],
        [
          "El ataque consiste en establecer un Punto de Acceso falso y esperar los intentos de autenticación de los usuarios legítimos. Estos intentos de autenticación se pueden utilizar para obtener las credenciales de los usuarios mediante un proceso de cracking",
          true
        ],
        [
          "El ataque se puede llevar a cabo aunque los usuarios se autentiquen en la red haciendo uso de un certificado de cliente",
          false
        ],
        [
          "El ataque se puede llevar a cabo aunque los usuarios validen los certificados de los Puntos de Acceso",
          false
        ]
      ]
    ],
    [
      "Indica cuáles de las siguientes maneras se pueden utilizar para poner una tarjeta Wi-Fi en modo monitor (Respuesta múltiple)",
      [
        [
          "Es el modo de operación por defecto de las tarjetas Wi-Fi, no es necesario realizar ninguna acción adicional",
          false
        ],
        [
          "Haciendo uso de la herramienta airmon-ng",
          true
        ],
        [
          "En versiones actuales de la herramienta airodump-ng la tarjeta se pone en modo monitor de manera automática sin necesidad de modificar el modo de operación de la tarjeta previamente",
          true
        ],
        [
          "Haciendo uso del comando iwconfig",
          true
        ]
      ]
    ],
    [
      "¿Cuál de los siguientes tipos de redes Wi-Fi se considera adecuada para una buena gestión de los usuarios que pueden acceder a la red?",
      [
        [
          "OPEN",
          false
        ],
        [
          "WPA2-PSK",
          false
        ],
        [
          "WPA2-Enterprise",
          true
        ],
        [
          "WEP",
          false
        ]
      ]
    ],
    [
      "Las redes de tipo WPA/WPA2-PSK permiten la trazabilidade de los usuarios a nivel de red. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Las redes de tipo OPEN Permiten acceder a la red Wi-Fi sin contraseña, pero ofrecen un cifrado de canal en capa 2 del modelo OSI ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "En una misma red inalámbrica no puede haber más de un punto de acceso ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Indica cuál de las siguientes premisas son necesarias para poder ejecutar con éxito un ataque de Punto de Acceso falso en una red de tipo WPA/WPA2-Enterprise (Respuesta múltiple)",
      [
        [
          "El dispositivo cliente no tiene que validar el certificado del Punto de Acceso",
          true
        ],
        [
          "La autenticación de los usuarios ha de realizarse mediante credenciales usuario/contraseña",
          true
        ],
        [
          "La autenticación de los usuarios ha de realizarse mediante certificados de cliente",
          false
        ],
        [
          "El dispositivo cliente tiene que validar el certificado del Punto de Acceso",
          false
        ]
      ]
    ],
    [
      "Indica cual es el método utilizado para intentar obtener la clave de acceso de una red WPA/WPA2-PSK en la que no hay conectado ningún cliente",
      [
        [
          "Establecer un punto de acceso falso con hostapd-wpe",
          false
        ],
        [
          "Capturar el PMKID y realizar un proceso de cracking offline",
          true
        ],
        [
          "Capturar numerosos vectores de inicialización de la red",
          false
        ],
        [
          "Capturar el 4-way-handshake y realizar un proceso de cracking offline",
          false
        ]
      ]
    ],
    [
      "La CA que genera los certificados del Punto de Acceso legítimo se puede desplegar en el cliente mediante el uso de MDM (Mobile Device Management) en sistemas Linux, macOS, Android e iOS. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ]
  ],
  "Examen para IC01": [
    [
      "¿Cuál es la mejor alternativa de recuperación en caso de infección por ransomware?",
      [
        [
          "Para el rescate, pero sólo una vez",
          false
        ],
        [
          "Realizar copias de seguridad periódicas",
          true
        ],
        [
          "Ninguna de las anteriores",
          false
        ],
        [
          "Activar los escudos antimalware",
          false
        ]
      ]
    ],
    [
      "¿Cuáles son las cuestiones clave en la protección de la información?",
      [
        [
          "Confidencialidad, Integridad y Disponibilidad",
          true
        ],
        [
          "Respaldo y Cifrado",
          false
        ],
        [
          "Acceso con credenciales",
          false
        ]
      ]
    ],
    [
      "Las Reglas Pragmáticas de la Ciberseguridad son las siguientes",
      [
        [
          "Equipo Blanco, Equipo Rojo y Equipo Azul",
          false
        ],
        [
          "Bastionado, Blindaje y Reacción",
          false
        ],
        [
          "Alerta temprana, Equipos de Respuesta y Análisis Post-Mortem",
          false
        ],
        [
          "Prevención, Concienciación y Respuesta",
          true
        ]
      ]
    ],
    [
      "¿Qué característica principal debe tener un buen proceso de respaldo?",
      [
        [
          "Que sea frecuente y completo",
          false
        ],
        [
          "Que no respalde también el malware",
          true
        ],
        [
          "Que no dependa de la versión del software de restauración",
          false
        ],
        [
          "Que incorpore un algoritmo de cifrado",
          false
        ]
      ]
    ],
    [
      "Un cortafuegos se puede implementar",
      [
        [
          "Sólo mediante software",
          false
        ],
        [
          "Mediante software o hardware",
          true
        ],
        [
          "Ninguna de las anteriores",
          false
        ],
        [
          "Sólo mediante hardware",
          false
        ]
      ]
    ],
    [
      "Limitar la Superficie de Exposición a las Amenazas consiste en",
      [
        [
          "Determinar los servicios que son estrictamente necesarios",
          false
        ],
        [
          "Implementar Medidas de Seguridad para Proteger el Acceso a la Información",
          false
        ],
        [
          "Todas las anteriores",
          true
        ],
        [
          "Limitar el número de máquinas de la LAN que tienen conexión directa con la WAN",
          false
        ]
      ]
    ],
    [
      "Para garantizar que los resultados de las auditorías supongan implantación continua de mejoras en Ciberseguridad",
      [
        [
          "Se debe adoptar sólo un modelo de madurez",
          false
        ],
        [
          "Se debe seleccionar sólo un esquema de mejora continua",
          false
        ],
        [
          "Cualquiera de las dos opciones anteriores es válida",
          true
        ]
      ]
    ],
    [
      "¿Cuáles son las amenazas habituales de la información?",
      [
        [
          "Todas las anteriores",
          true
        ],
        [
          "Hackers",
          false
        ],
        [
          "Intrusiones y Malware",
          false
        ],
        [
          "Ataques Físicos",
          false
        ]
      ]
    ],
    [
      "¿En qué consiste la Ciberseguridad?",
      [
        [
          "En desarrollar aplicaciones antimalware",
          false
        ],
        [
          "En proteger los sistemas de información de una empresa",
          false
        ],
        [
          "En aplicar las estrategias de la seguridad clásica a la Cibernética",
          true
        ]
      ]
    ],
    [
      "La Cultura de Seguridad de la Información de una Empresa atañe a",
      [
        [
          "Sus clientes",
          false
        ],
        [
          "Sus empleados",
          false
        ],
        [
          "Sus proveedores",
          false
        ],
        [
          "Todos los anteriores",
          true
        ]
      ]
    ],
    [
      "¿Qué organismo publica periódicamente el Decálogo Básico de Ciberseguridad?",
      [
        [
          "El INCIBE",
          false
        ],
        [
          "El CNI",
          false
        ],
        [
          "El CCN",
          true
        ],
        [
          "El CSIRT",
          false
        ]
      ]
    ],
    [
      "La Ingeniería Social es",
      [
        [
          "Espionaje con Keyloggers",
          false
        ],
        [
          "Espionaje de cualquier tipo",
          true
        ],
        [
          "Espionaje con personas",
          false
        ],
        [
          "Espionaje con Stealers",
          false
        ]
      ]
    ],
    [
      "El Inventario de Activos de una Empresa contiene",
      [
        [
          "La información relativa a su Entorno Informático",
          false
        ],
        [
          "La información relativa a su Entorno Productivo",
          false
        ],
        [
          "Todo lo anterior",
          true
        ],
        [
          "Los equipos de comunicaciones de su red",
          false
        ]
      ]
    ],
    [
      "Para implementar la Ciberseguridad en una organización hay que",
      [
        [
          "Implementar un SOC",
          false
        ],
        [
          "Adquirir el mejor antimalware",
          false
        ],
        [
          "Conocer el Nivel de Seguridad Existente y establecer el Nivel de Seguridad Objetivo",
          true
        ],
        [
          "Bastionar todos los servidores",
          false
        ]
      ]
    ],
    [
      "¿Qué información recoge la norma ISO/IEC 27001?",
      [
        [
          "La Ley Orgánica de Protección de Datos de Carácter Personal",
          false
        ],
        [
          "Los requisitos para los sistemas de gestión de la seguridad de la información",
          true
        ],
        [
          "El reglamento general de protección de datos",
          false
        ],
        [
          "Las consideraciones de seguridad perimetral en una organización",
          false
        ]
      ]
    ],
    [
      "Los Procesos de Compliance tienen que ver con",
      [
        [
          "Prevención del Fraude",
          false
        ],
        [
          "Gestión de Permisos",
          false
        ],
        [
          "Cumplimiento Legal",
          true
        ],
        [
          "Fuga de Datos",
          false
        ]
      ]
    ],
    [
      "¿Qué organismo publica periódicamente el Kit de Concienciación en Ciberseguridad?",
      [
        [
          "El CNI",
          false
        ],
        [
          "El INCIBE",
          true
        ],
        [
          "El CCN",
          false
        ],
        [
          "El CSIRT",
          false
        ]
      ]
    ],
    [
      "Hydra es",
      [
        [
          "Una herramienta de ataque a bases de datos",
          false
        ],
        [
          "Un constructor de diccionarios",
          false
        ],
        [
          "Una herramienta de ataque a ficheros cifrados",
          false
        ],
        [
          "Un network logon cracker",
          true
        ]
      ]
    ],
    [
      "En el Cifrado Asimétrico",
      [
        [
          "Ambas claves pueden cifrar",
          false
        ],
        [
          "Se cifra con la clave pública y se descifra con la clave privada",
          true
        ],
        [
          "Se cifra con la clave privada y se descifra con la pública",
          false
        ],
        [
          "Ambas claves pueden descifrar",
          false
        ]
      ]
    ],
    [
      "¿Cuál es la forma más sencilla de concienciar de forma recurrente acerca de cuestiones de Ciberseguridad?",
      [
        [
          "Instalar sistemas de alerta temprana",
          false
        ],
        [
          "Editar un Boletín Interno y una Newsletter Externa",
          true
        ],
        [
          "Notificar los incidentes en tiempo real a los afectados",
          false
        ]
      ]
    ]
  ],
  "Examen para NDC01": [
    [
      "ACME se compromete con un cliente a contar con la certificación ISO27001, este compromiso es",
      [
        [
          "Obligatorio",
          false
        ],
        [
          "Voluntario",
          false
        ],
        [
          "Obligatorio contractual",
          true
        ],
        [
          "Buena práctica",
          false
        ]
      ]
    ],
    [
      "Dentro de los códigos éticos, nos tendríamos que encontrar elementos de relacionados con la responsabilidad social corporativa. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "La función de cumplimiento normativo es puntual en el tiempo, con un inicio, un final y un resultado. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Los códigos éticos mejoran la percepción que tienen las personas sobre las empresas. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Cuál de las siguientes afirmaciones es correcta con respecto al compliance officer?",
      [
        [
          "No tiene por qué conocer el negocio de la organización",
          false
        ],
        [
          "Debe certificar el sistema de gestión de cumplimiento",
          false
        ],
        [
          "Puede actuar de contacto con el regulador",
          true
        ],
        [
          "No es responsable de los incumplimientos de terceros subcontratados",
          false
        ]
      ]
    ],
    [
      "El compliance officer puede tener responsabilidad penal sobre un incumplimiento legal. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Un código ético incluirá elementos para",
      [
        [
          "Especificar las medidas de protección de la información posibles",
          false
        ],
        [
          "Establecer una correcta climatización del lugar de trabajo",
          false
        ],
        [
          "Establecer los principios y valores que rijan a una organización",
          true
        ],
        [
          "Conseguir salarios equitativos para todos los empleados",
          false
        ]
      ]
    ],
    [
      "Las normas de seguridad de la información en ISO son de la familia",
      [
        [
          "20000",
          false
        ],
        [
          "14000",
          false
        ],
        [
          "9000",
          false
        ],
        [
          "27000",
          true
        ]
      ]
    ],
    [
      "El cumplimiento de un código ético supone a una empresa un esfuerzo adicional al del cumplimiento de sus obligaciones legales. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "La función principal del compliance officer es",
      [
        [
          "Ahorrar costes en la organización",
          false
        ],
        [
          "Que los responsables de la empresa no reciban sanciones penales",
          false
        ],
        [
          "Evitar pérdidas por multas a la organización",
          false
        ],
        [
          "Identificar riesgos penales y velar por el cumplimiento de los requisitos legales y normativos",
          true
        ]
      ]
    ],
    [
      "¿Cuál de los siguientes elementos puede ser un tercero relacionado con una organización?",
      [
        [
          "Empleados",
          false
        ],
        [
          "Directores",
          false
        ],
        [
          "Distribuidores",
          true
        ],
        [
          "Becarios",
          false
        ]
      ]
    ],
    [
      "¿Qué es más probable que nos encontremos en una política de buen gobierno corporativo?",
      [
        [
          "Cultura, valores y principios",
          true
        ],
        [
          "Políticas de teletrabajo para los empleados",
          false
        ],
        [
          "Planes comerciales",
          false
        ],
        [
          "Procedimientos operativos de negocio",
          false
        ]
      ]
    ],
    [
      "Cuando se analiza un proveedor con un proceso de diligencia debida positivo, ya no es necesario monitorizarlo. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Las buenas prácticas son",
      [
        [
          "Acciones recomendadas para llevar a cabo una actividad que han resultado satisfactorias para la organización",
          true
        ],
        [
          "Acciones que han salido bien en otras organizaciones",
          false
        ],
        [
          "Acciones que es probable sean positivas para la organización",
          false
        ],
        [
          "Acciones que salen bien tras intentos de ejecución reiterados",
          false
        ]
      ]
    ],
    [
      "La cultura, valores y principios de la organización siempre deben contar con la existencia de",
      [
        [
          "Una misión y visión de la organización",
          true
        ],
        [
          "Un procedimiento de altas y bajas de empleados",
          false
        ],
        [
          "Una estrategia comercial",
          false
        ],
        [
          "Un organigrama de la organización",
          false
        ]
      ]
    ],
    [
      "El objetivo del cumplimiento normativo en una empresa es",
      [
        [
          "Que los empleados cumplan el horario establecido",
          false
        ],
        [
          "Justificar incumplimientos ante los supervisores",
          false
        ],
        [
          "Asegurar los beneficios a los responsables de las empresas",
          false
        ],
        [
          "Operar el negocio de acuerdo a las leyes existentes",
          true
        ]
      ]
    ],
    [
      "El único estándar de seguridad de la información es ISO 27001. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Cual de estos elementos NO estará incluido en la documentación sobre la estructura organizativa de la empresa.",
      [
        [
          "Líneas de reporte",
          false
        ],
        [
          "Programas formativos",
          true
        ],
        [
          "Organigrama de la organización",
          false
        ],
        [
          "Roles y responsabilidades",
          false
        ]
      ]
    ],
    [
      "El cumplimiento del RGPD es un compromiso",
      [
        [
          "Voluntario",
          false
        ],
        [
          "Obligatorio legal",
          true
        ],
        [
          "Voluntario por normas y estándares",
          false
        ],
        [
          "Obligatorio por mandamiento judicial",
          false
        ]
      ]
    ],
    [
      "El compliance officer",
      [
        [
          "Debe tener un salario elevado para evitar sobornos",
          false
        ],
        [
          "Debe ser consciente de la legislación vigente que afecta a la organización",
          true
        ],
        [
          "Debe tener conocimientos de seguridad informática",
          false
        ],
        [
          "Debe tener potestad de rescindir el contrato de un empleado",
          false
        ]
      ]
    ]
  ],
  "Examen para NDC02": [
    [
      "Una circunstancia desfavorable que, de ocurrir, tendrá consecuencias negativas en la organización, es",
      [
        [
          "Un riesgo",
          false
        ],
        [
          "Una vulnerabilidad",
          false
        ],
        [
          "Una amenaza",
          true
        ],
        [
          "Un impacto",
          false
        ]
      ]
    ],
    [
      "Cuando no se esta realizando acción alguna sobre un riesgo, ¿qué opción de tratamiento se esta tomando?",
      [
        [
          "Mitigar",
          false
        ],
        [
          "Asumir",
          true
        ],
        [
          "Reducir",
          false
        ],
        [
          "Eliminar",
          false
        ]
      ]
    ],
    [
      "La norma ISO 37301:2021 es el estándar de la Organización Internacional de Estandarización que especifica los requisitos y establece una guía para implementar, desarrollar, evaluar, mantener, auditar y mejorar un Sistema de Gestión de Cumplimiento eficaz en una organización. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "ACME ha tomado la decisión de no prestar servicios de prestamos dispositivos móviles por los riesgos financieros que implica el proceso.¿Qué opción del tratamiento del riesgo se esta tomando?",
      [
        [
          "Evitar",
          true
        ],
        [
          "Eliminar",
          true
        ],
        [
          "Mitigar",
          false
        ],
        [
          "Reducir",
          false
        ]
      ]
    ],
    [
      "Tras un informe de riesgos de seguridad de la información, el área de IT va a implantar una serie de medidas para aumentar la seguridad de un sistema. ¿Qué opción de tratamiento se esta tomando?",
      [
        [
          "Evitar",
          false
        ],
        [
          "Mitigar",
          true
        ],
        [
          "Eliminar",
          false
        ],
        [
          "Reducir",
          false
        ]
      ]
    ],
    [
      "La norma ISO 31000 es utilizada para gestionar riesgos de...",
      [
        [
          "Seguridad de la información",
          false
        ],
        [
          "Riesgos de cumplimiento normativo",
          false
        ],
        [
          "Cualquier tipo de riesgo",
          true
        ],
        [
          "Riesgos Penales",
          false
        ]
      ]
    ],
    [
      "El producto del impacto por la probabilidad, es",
      [
        [
          "Un riesgo",
          true
        ],
        [
          "Un impacto",
          false
        ],
        [
          "Una consecuencia",
          false
        ],
        [
          "Una vulnerabilidad",
          false
        ]
      ]
    ],
    [
      "¿En que epígrafe del SGC se desarrollará el plan de comunicación?",
      [
        [
          "Planificación del sistema",
          false
        ],
        [
          "Soporte al sistema de gestión",
          true
        ],
        [
          "Operación del sistema",
          false
        ],
        [
          "Evaluación de desempeño",
          false
        ]
      ]
    ],
    [
      "¿En que documento del sistema de gestión de compliance se detallará la función de la organización?",
      [
        [
          "Liderazgo de la dirección",
          false
        ],
        [
          "Operación del sistema",
          false
        ],
        [
          "Contexto de la organización",
          true
        ],
        [
          "Planificación del sistema",
          false
        ]
      ]
    ],
    [
      "¿En que epígrafe del SGC se llevará a cabo la auditoría sobre el sistema de gestión cumplimiento normativo de la organización?",
      [
        [
          "Evaluación de desempeño",
          true
        ],
        [
          "Operación del sistema",
          false
        ],
        [
          "Soporte al sistema de gestión",
          false
        ],
        [
          "Planificación del sistema",
          false
        ]
      ]
    ],
    [
      "Un ciberdelincuente mayor de edad ha sido detenido y acusado por causar daños contra una empresa privada ¿A que juzgado acudirá?",
      [
        [
          "Juzgado de lo penal",
          true
        ],
        [
          "Juzgado de lo social",
          false
        ],
        [
          "Juzgado de lo mercantil",
          false
        ],
        [
          "Juzgado de Paz",
          false
        ]
      ]
    ],
    [
      "¿En que epígrafe del SGC se llevará a cabo el análisis de riesgos de cumplimiento normativo de la organización?",
      [
        [
          "Contexto de la organización",
          true
        ],
        [
          "Planificación del sistema",
          false
        ],
        [
          "Soporte al sistema de gestión",
          false
        ],
        [
          "Operación del sistema",
          false
        ]
      ]
    ],
    [
      "La norma ISO 37301:2021 cuenta con 13 dominios y 2 anexos. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "La valoración cuantitativa de un riesgo consiste en asignar un valor numérico a un riesgo identificado. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿En que epígrafe del SGC se tratará el proceso de gestión de incidencias de cumplimiento?",
      [
        [
          "Planificación del sistema",
          false
        ],
        [
          "Evaluación de desempeño",
          false
        ],
        [
          "Operación del sistema",
          true
        ],
        [
          "Soporte al sistema de gestión",
          false
        ]
      ]
    ],
    [
      "Cuando se contrata una póliza de ciber riesgos. ¿Qué opción de tratamiento se esta tomando?",
      [
        [
          "Reducir",
          false
        ],
        [
          "Transferir",
          true
        ],
        [
          "Eliminar",
          false
        ],
        [
          "Mitigar",
          false
        ]
      ]
    ],
    [
      "Como si de un vehiculo privado se tratase, los barcos superpetroleros estan asegurados, por lo general por un consorcio de seguros. ¿Qué opción de tratamiento de riesgos se estan tomando las aseguradoras?",
      [
        [
          "Reducir",
          false
        ],
        [
          "Compartir",
          true
        ],
        [
          "Eliminar",
          false
        ],
        [
          "Evitar",
          false
        ]
      ]
    ],
    [
      "La primera norma ISO sobre cumplimiento normativo es la ISO 37301. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Una debilidad que presenta un activo o un proceso, es",
      [
        [
          "Una vulnerabilidad",
          true
        ],
        [
          "Un impacto",
          false
        ],
        [
          "Una amenaza",
          false
        ],
        [
          "Un riesgo",
          false
        ]
      ]
    ],
    [
      "¿En que epígrafe del SGC se detallan las acciones realizadas para dar respuesta a unas observaciones identificadas tras una auditoría al sistema de gestión de compliance?",
      [
        [
          "Planificación del sistema",
          false
        ],
        [
          "Mejora continua",
          true
        ],
        [
          "Operación del sistema",
          false
        ],
        [
          "Soporte al sistema de gestión",
          false
        ]
      ]
    ]
  ],
  "Examen para PPS01": [
    [
      "Las pruebas deben centrarse en",
      [
        [
          "sólo probar que el programa hace lo que debe hacer",
          false
        ],
        [
          "sólo probar datos válidos",
          false
        ],
        [
          "sólo probar datos esperados",
          false
        ],
        [
          "probar que el programa hace lo que debe hacer y no hace lo que no debe hacer",
          true
        ]
      ]
    ],
    [
      "El objetivo de las pruebas de software es",
      [
        [
          "Eliminar líneas de código redundantes",
          false
        ],
        [
          "Garantizar la calidad del software",
          true
        ],
        [
          "Verificar que no usamos datos que no necesitamos",
          false
        ],
        [
          "Someter a pruebas de estrés al códido fuente",
          false
        ]
      ]
    ],
    [
      "Linux está escrito principalmente en",
      [
        [
          "Golang",
          false
        ],
        [
          "Lenguaje C",
          true
        ],
        [
          "Python",
          false
        ],
        [
          "Go",
          false
        ]
      ]
    ],
    [
      "Cuando estamos desarrollando software es recomendable",
      [
        [
          "Conocer el número de funciones que necesitamos",
          false
        ],
        [
          "Saber que pruebas de software vamos a realizar",
          false
        ],
        [
          "Conocer el resultado de nuestro código de manera exacta",
          false
        ],
        [
          "Tener un entorno de desarrollo",
          true
        ]
      ]
    ],
    [
      "El uso de librerías y frameworks desde el punto de vista de la ciberseguridad puede exponer a las aplicaciones a una serie de riesgos y amenazas. ¿Verdadero o falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Las pruebas funcionales buscan emular un escenario concreto, a veces son llamadas pruebas de caja negra. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Los lenguajes de bajo nivel son los más cercanos al binario. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "La elección de un lenguaje de programación en un proyecto vendrá condicionada o determinada por",
      [
        [
          "Requisitos técnicos",
          false
        ],
        [
          "Todas las anteriores",
          true
        ],
        [
          "Rendimiento",
          false
        ],
        [
          "Tiempos de entrega",
          false
        ]
      ]
    ],
    [
      "El rendimiento general del lenguaje Python respecto al lenguaje C es",
      [
        [
          "Bastante superior",
          false
        ],
        [
          "Siempre similar puesto que usan mismo intérprete",
          false
        ],
        [
          "Inferior al depender de un intérprete",
          true
        ],
        [
          "Depende del proyecto pero superior en general",
          false
        ]
      ]
    ],
    [
      "El lenguaje máquina es un lenguaje a bajo nivel. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Un algoritmo es la implementación concreta de un programa en un lenguaje de programación específico ¿verdadero o falso?",
      [
        [
          "Verdadero",
          false
        ],
        [
          "Falso",
          true
        ]
      ]
    ],
    [
      "Podemos clasificar de forma sencilla cual es el lenguaje mas inseguro",
      [
        [
          "No hay lenguajes inseguros",
          false
        ],
        [
          "Debido a su diseño",
          false
        ],
        [
          "Debido a su implementación",
          false
        ],
        [
          "No podemos hablar tanto de lenguajes inseguros sino de su implementación o volúmen de vulnerabilidades econtradas",
          true
        ]
      ]
    ],
    [
      "Podríamos definir el software cómo",
      [
        [
          "Programas e instrucciones para ejecutar tareas en un ordenador",
          true
        ],
        [
          "Conjunto de módulos mecánicos de un ordenador",
          false
        ],
        [
          "Conjunto de instrucciones de un aplicativo",
          false
        ],
        [
          "Conjunto de módulos físicos de un ordenador",
          false
        ]
      ]
    ],
    [
      "Si tuviéramos que clasificar el lenguaje de programación con más vulnerabilidades sería sin duda el lenguaje C. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "Un programa compilado sólo funciona para la plataforma para la que se ha compilado. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "El lenguaje intermedio se compila..",
      [
        [
          "a un lenguaje intermedio que mas tarde se ejecuta en una máquina virtual",
          true
        ],
        [
          "Con compiladores específicos",
          false
        ],
        [
          "Nunca se compila",
          false
        ],
        [
          "Con conmpiladores especiales modulares",
          false
        ]
      ]
    ],
    [
      "¿Qué lenguaje de programación es más apropiado para las plataformas móviles IOS?",
      [
        [
          "PHP",
          false
        ],
        [
          "Swift",
          true
        ],
        [
          "Ruby",
          false
        ],
        [
          "Java",
          false
        ]
      ]
    ],
    [
      "Uno de los hándicaps de Python es",
      [
        [
          "Es un lenguaje obsoleto sin soporte",
          false
        ],
        [
          "Un lenguaje poco usado por la comunidad",
          false
        ],
        [
          "Su rendimiento se ve mermado debido a las limitaciones impuestas por el intérprete",
          true
        ],
        [
          "Apenas tiene librerias",
          false
        ]
      ]
    ],
    [
      "El lenguaje C es uno de los lenguajes más antiguos y por tanto se ha usado durante más tiempo, por lo tanto a más tiempo expuesto mas vulnerabilidades encontradas. ¿Verdadero o Falso?",
      [
        [
          "Verdadero",
          true
        ],
        [
          "Falso",
          false
        ]
      ]
    ],
    [
      "¿Qué lenguaje de programación es más apropiado para las plataformas móviles Android?",
      [
        [
          "Java",
          true
        ],
        [
          "Ruby",
          false
        ],
        [
          "Swift",
          false
        ],
        [
          "PHP",
          false
        ]
      ]
    ]
  ]
}